In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
pd.Series(['a','b','c','d','e'])

0    a
1    b
2    c
3    d
4    e
dtype: object

In [3]:
pd.Series({'Community':100,'Stranger Things':95,'Rick and Morty':98})

Community          100
Rick and Morty      98
Stranger Things     95
dtype: int64

# DataFrame

In [4]:
two_d_arr = np.arange(25).reshape(5,5)
two_d_arr

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [5]:
data_framed = pd.DataFrame(two_d_arr, index=['a','b','c','d','e'], columns=['col A','col B','col C','col D','col E'])
data_framed

   col A  col B  col C  col D  col E
a      0      1      2      3      4
b      5      6      7      8      9
c     10     11     12     13     14
d     15     16     17     18     19
e     20     21     22     23     24

In [6]:
column_c = data_framed['col C']
column_c

a     2
b     7
c    12
d    17
e    22
Name: col C, dtype: int64

In [7]:
x, w = np.random.randn(9).reshape(3,3), np.random.randn(9).reshape(3,3)
x, w = pd.DataFrame(x, columns=['A','B','C']), pd.DataFrame(w, columns=['D','E','F'])

In [8]:
x

          A         B         C
0  0.159162 -1.730661 -0.546157
1 -0.136427 -0.759198 -1.199710
2 -0.124745  0.311800 -0.548739

In [9]:
w

          D         E         F
0  1.920186  2.177146  1.216306
1 -0.172263 -0.440601  0.732405
2 -1.338624  1.889602 -0.425582

In [10]:
xw = pd.concat((x,w),axis=1)
xw

          A         B         C         D         E         F
0  0.159162 -1.730661 -0.546157  1.920186  2.177146  1.216306
1 -0.136427 -0.759198 -1.199710 -0.172263 -0.440601  0.732405
2 -0.124745  0.311800 -0.548739 -1.338624  1.889602 -0.425582

In [11]:
x.sort_values(by=['A'])

          A         B         C
1 -0.136427 -0.759198 -1.199710
2 -0.124745  0.311800 -0.548739
0  0.159162 -1.730661 -0.546157

In [12]:
y = xw[xw < 0]
y

          A         B         C         D         E         F
0       NaN -1.730661 -0.546157       NaN       NaN       NaN
1 -0.136427 -0.759198 -1.199710 -0.172263 -0.440601       NaN
2 -0.124745       NaN -0.548739 -1.338624       NaN -0.425582

In [13]:
sum_A = sum(xw['A'])
sum_A

-0.10201046127877637